tutorials/incompressible/pimpleFoam/laminar/filmPanel0/constant/g
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       uniformDimensionedVectorField;
    location    "constant";
    object      g;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

alpha       5;
alphax      0;

dimensions  [0 1 -2 0 0 0 0];

value #eval
{
    -9.81 * vector
    (
        sin(degToRad($alphax)),
        sin(degToRad($alpha)),
        cos(degToRad($alpha))
    )
};


// ************************************************************************* //
